from typing import Any
from sqlalchemy.ext.declarative import as_declarative, declared_attr

# ----------------------------------------------------------------------
# کلاس پایه Declarative (اعلامی) برای تمامی مدل‌ها
# ----------------------------------------------------------------------

# Decorator @as_declarative این کلاس را به یک پایه برای مدل‌های SQLAlchemy تبدیل می‌کند.
@as_declarative()
class Base:
    """
    کلاس پایه برای مدل‌های SQLAlchemy.
    این کلاس قابلیت تولید خودکار نام جدول را از روی نام کلاس مدل فراهم می‌کند.
    """
    
    # تعریف Type Hint برای 'id' برای استفاده توسط ابزارهای بررسی استاتیک
    # این ستون در کلاس‌های مدل مشتق شده تعریف خواهد شد.
    id: Any
    
    # __name__: برای اطمینان از تعریف نام کلاس
    __name__: str
    
    # تولید نام جدول به صورت خودکار
    @declared_attr
    def __tablename__(cls) -> str:
        """
        نام جدول را به صورت خودکار از روی نام کلاس (با حروف کوچک) تولید می‌کند.
        مثال: کلاس User -> جدول 'user'
        """
        return cls.__name__.lower()
